Fescron/diy-logging-volt-ampmeter/firmware/STM32F103C8T6_powermeter-interface/Core/Src/usart.c
/***************************************************************************//**
 * @file usart.c
 * @brief U(S)ART functionality for high-precision logging voltage/current meter.
 * @version 1.0
 * @author Brecht Van Eeckhoudt
 *
 * ******************************************************************************
 *
 * @section Versions
 *
 *   @li v1.0: Initial version.
 *
 * ******************************************************************************
 *
 * @todo
 *   **Future improvements:**@n
 *     - Increase baudrate for USART2/3 communication?
 *     - Add separate USART1 handler? (`USART_HandleContinuousReception();`)
 *     - Add overflow catch if data.voltage/current are negative values?
 *        - `data.current > 9.9999`, `data.voltage > 99.999`
 *     - Compare floats more reliably.
 *     - Check if we really did receive the openLog startup-message `12<`.
 *
 * ******************************************************************************
 *
 * @section License
 *
 *   **Copyright (C) 2021 - Brecht Van Eeckhoudt**
 *
 *   This program is free software: you can redistribute it and/or modify
 *   it under the terms of the **GNU General Public License** as published by
 *   the Free Software Foundation, either **version 3** of the License, or
 *   (at your option) any later version.
 *
 *   This program is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU General Public License for more details.
 *
 *   *A copy of the GNU General Public License can be found in the `LICENSE`
 *   file along with this source code.*
 *
 *   @n
 *
 *   Some methods also use code obtained from examples from STMicroelectronics.
 *
 *   @li https://github.com/STMicroelectronics/STM32CubeF1/tree/master/Projects/STM32F103RB-Nucleo/Examples_LL/USART/USART_Communication_Rx_IT_Continuous
 *
 *   **Copyright (c) 2020 STMicroelectronics. All rights reserved.**
 *
 *   These sections are licensed by ST under BSD 3-Clause license, the "License";
 *   One may not use these example files except in compliance with the License.
 *   One may obtain a copy of the License at: opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************/


#include "usart.h"              /* Include corresponding header file */

#include <stdint.h>             /* (u)intXX_t */
#include "stm32f1xx_ll_bus.h"   /* Low-Level Clock Management */
#include "stm32f1xx_ll_gpio.h"  /* Low-Level General Purpose IO (GPIO) peripheral API */
#include "stm32f1xx_ll_usart.h" /* Low-Level Universal synchr./asynchr. receiver/transmitter (USART/UART) Peripheral API */
#include "SEGGER_RTT.h"         /* Segger RTT functionality (debugging) */

#include "util.h"               /* Utility functionality */
#include "main.h"				/* Pin mapping */
#include "conversion.h"			/* Conversion and settings */


/* Local definitions */
#define RX_BUFFER_SIZE       8
#define RX_BUFFER_SIZE_UART1 3
#define BAUDRATE_METER       9600   /* Baudrate of volt/currentmeter */
#define BAUDRATE_LOGGER      115200 /* Baudrate of external datalogger */


/* Local variables */

/* USART1 RX buffers for storing received data */
uint8_t aRXBufferA_USART1[RX_BUFFER_SIZE_UART1];
uint8_t aRXBufferB_USART1[RX_BUFFER_SIZE_UART1];
__IO uint32_t uwNbReceivedChars_USART1;
__IO uint32_t uwBufferReadyIndication_USART1;
uint8_t *pBufferReadyForUser_USART1;
uint8_t *pBufferReadyForReception_USART1;

/* USART2 RX buffers for storing received data */
uint8_t aRXBufferA_USART2[RX_BUFFER_SIZE];
uint8_t aRXBufferB_USART2[RX_BUFFER_SIZE];
__IO uint32_t uwNbReceivedChars_USART2;
__IO uint32_t uwBufferReadyIndication_USART2;
uint8_t *pBufferReadyForUser_USART2;
uint8_t *pBufferReadyForReception_USART2;

/* USART3 RX buffers for storing received data */
uint8_t aRXBufferA_USART3[RX_BUFFER_SIZE];
uint8_t aRXBufferB_USART3[RX_BUFFER_SIZE];
__IO uint32_t uwNbReceivedChars_USART3;
__IO uint32_t uwBufferReadyIndication_USART3;
uint8_t *pBufferReadyForUser_USART3;
uint8_t *pBufferReadyForReception_USART3;


/* Local prototypes */
// None


/**************************************************************************//**
 * @brief
 *   This function monitors USART1/2/3 buffer filling indication and
 *   moves data around accordingly.
 *****************************************************************************/
void USART_HandleContinuousReception(void)
{
	/* Checks if USART1 Buffer full indication has been set */
	if (uwBufferReadyIndication_USART1 != 0)
	{
		/* Call user Callback in charge of consuming data from filled USART2 buffer */
		SEGGER_RTT_printf(0, "Current USART1 RX buffer full: [%s], Reception will go on in alternate buffer.\n\r", pBufferReadyForUser_USART1);

		/* Signal logic that the logger has correctly started up */
		settings.loggerReady = 1;

		/* Reset USART1 indication */
		uwBufferReadyIndication_USART1 = 0;
	}

	/* Checks if USART2 Buffer full indication has been set */
	if (uwBufferReadyIndication_USART2 != 0)
	{
		data.voltage = bytes_to_float(pBufferReadyForUser_USART2[6], pBufferReadyForUser_USART2[5], pBufferReadyForUser_USART2[4], pBufferReadyForUser_USART2[3]);

		if (data.voltage < 99.999) /* Meter reads max 50V ... */
		{
			if (data.oldVolt != data.voltage)
			{
			  data.oldVolt = data.voltage;
			  data.newVolt = 1;
			}

			/* Update min/max fields if necessary */
			if (data.voltage < data.minVoltage)
			{
				data.minVoltage = data.voltage;
				data.newMinVolt = 1;
			}
			else if (data.firstVolt)
			{
				data.minVoltage = data.voltage;
				data.newMinVolt = 1;
				data.firstVolt = 0;
			}

			if (data.voltage > data.maxVoltage)
			{
				data.maxVoltage = data.voltage;
				data.newMaxVolt = 1;
			}

			data.voltReceived = 1;
		}

		/* Reset USART2 indication */
		uwBufferReadyIndication_USART2 = 0;

	}

	/* Checks if USART3 Buffer full indication has been set */
	if (uwBufferReadyIndication_USART3 != 0)
	{
		data.current = bytes_to_float(pBufferReadyForUser_USART3[6], pBufferReadyForUser_USART3[5], pBufferReadyForUser_USART3[4], pBufferReadyForUser_USART3[3]);

		if (data.current < 9.9999) /* Meter reads max 5A ... */
		{
			if (data.oldCurr != data.current)
			{
			  data.oldCurr = data.current;
			  data.newCurr = 1;
			}

