Fescron/diy-logging-volt-ampmeter/firmware/STM32F103C8T6_powermeter-interface/Core/Src/usart.c
			/* Update min/max fields if necessary */
			if (data.current < data.minCurrent)
			{
				data.minCurrent = data.current;
				data.newMinCurr = 1;
			}
			else if (data.firstCurr)
			{
				data.minCurrent = data.current;
				data.newMinCurr = 1;
				data.firstCurr = 0;
			}

			if (data.current > data.maxCurrent)
			{
				data.maxCurrent = data.current;
				data.newMaxCurr = 1;
			}

			data.currReceived = 1;
		}

		/* Reset USART13indication */
		uwBufferReadyIndication_USART3 = 0;
	}

	/* Set values if the voltmeter is powered down */
	if (!LL_GPIO_IsInputPinSet(V_ENin_GPIO_Port, V_ENin_Pin))
	{
		data.voltage = 0.0;

		if (data.oldVolt != data.voltage)
		{
		  data.oldVolt = data.voltage;
		  data.newVolt = 1;
		}

		data.voltReceived = 1;
	}

	/* Set values if the current meter is powered down */
	if (!LL_GPIO_IsInputPinSet(A_ENin_GPIO_Port, A_ENin_Pin))
	{
		data.current = 0.0;

		if (data.oldCurr != data.current)
		{
		  data.oldCurr = data.current;
		  data.newCurr = 1;
		}

		data.currReceived = 1;
	}
}


/**************************************************************************//**
 * @brief
 *   Send a byte (`uint8_t`) command to USART2.
 *
 * @details
 *   This method also resets `uwNbReceivedChars_USART2` just in case.
 *
 * @param[in] command
 *   Pointer to the byte-array containing the commands.
 *
 * @param[in] bytes
 *   Amount of bytes to send.
 *****************************************************************************/
void USART2_SendCommand(uint8_t *command, uint8_t bytes)
{
	/* Send characters one per one, until last char to be sent */
	for (uint32_t index = 0; index < bytes; index++)
	{
		/* Wait for TXE flag to be raised */
		while (!LL_USART_IsActiveFlag_TXE(USART2));

		/* Write character in Transmit Data register.
		   TXE flag is cleared by writing data in DR register */
		LL_USART_TransmitData8(USART2, command[index]);
	}

	/* Wait for TC flag to be raised for last char */
	while (!LL_USART_IsActiveFlag_TC(USART2));

	/* Reset buffer mechanism */
	uwNbReceivedChars_USART2 = 0;
//	uwBufferReadyIndication_USART2 = 0; // TODO Maybe use this when using contiuous output?
}


/**************************************************************************//**
 * @brief
 *   Send a byte (`uint8_t`) command to USART3.
 *
 * @details
 *   This method also resets `uwNbReceivedChars_USART3` just in case.
 *
 * @param[in] command
 *   Pointer to the byte-array containing the commands.
 *
 * @param[in] bytes
 *   Amount of bytes to send.
 *****************************************************************************/
void USART3_SendCommand(uint8_t *command, uint8_t bytes)
{
	/* Send characters one per one, until last char to be sent */
	for (uint32_t index = 0; index < bytes; index++)
	{
		/* Wait for TXE flag to be raised */
		while (!LL_USART_IsActiveFlag_TXE(USART3));

		/* Write character in Transmit Data register.
		   TXE flag is cleared by writing data in DR register */
		LL_USART_TransmitData8(USART3, command[index]);
	}

	/* Wait for TC flag to be raised for last char */
	while (!LL_USART_IsActiveFlag_TC(USART3));

	/* Reset buffer mechanism */
	uwNbReceivedChars_USART3 = 0;
//	uwBufferReadyIndication_USART3 = 0; // TODO Maybe use this when using contiuous output?
}


/**************************************************************************//**
 * @brief
 *   USART1 Initialization Function.
 *
 * @details
 *   @li Baudrate = BAUDRATE_LOGGER
 *   @li PA9  = USART1_TX
 *   @li PA10 = USART1_RX
 *****************************************************************************/
void USART1_INIT(void)
{
	LL_USART_InitTypeDef USART_InitStruct = {0};
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

	/* Peripheral clock enable */
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA);

	/**USART1 GPIO Configuration
	PA9   ------> USART1_TX
	PA10   ------> USART1_RX
	*/
	GPIO_InitStruct.Pin = LL_GPIO_PIN_9;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_10;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_FLOATING;
	LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* USART1 interrupt Init */
	NVIC_SetPriority(USART1_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
	NVIC_EnableIRQ(USART1_IRQn);

	/* UART1 Configuration */
	USART_InitStruct.BaudRate = BAUDRATE_LOGGER;
	USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
	USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
	USART_InitStruct.Parity = LL_USART_PARITY_NONE;
	USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
	USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
	USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
	LL_USART_Init(USART1, &USART_InitStruct);
	LL_USART_ConfigAsyncMode(USART1);
	LL_USART_Enable(USART1);

	/* Initiate buffer mechanism */
	pBufferReadyForReception_USART1 = aRXBufferA_USART1;
	pBufferReadyForUser_USART1      = aRXBufferB_USART1;
	uwNbReceivedChars_USART1 = 0;
	uwBufferReadyIndication_USART1 = 0;

	/* Clear Overrun flag, in case characters have already been sent to USART */
	LL_USART_ClearFlag_ORE(USART1);

	/* Enable RXNE and Error interrupts */
	LL_USART_EnableIT_RXNE(USART1);
	LL_USART_EnableIT_ERROR(USART1);
}


/**************************************************************************//**
 * @brief
 *   USART2 Initialization Function.
 *
 * @details
 *   @li Baudrate = BAUDRATE_METER
 *   @li PA2 = USART2_TX
 *   @li PA3 = USART2_RX
 *****************************************************************************/
void USART2_INIT(void)
{
	LL_USART_InitTypeDef USART_InitStruct = {0};
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

	/* Peripheral clock enable */
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOA);

	/**USART2 GPIO Configuration
	PA2   ------> USART2_TX
	PA3   ------> USART2_RX
	*/
	GPIO_InitStruct.Pin = LL_GPIO_PIN_2;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

