Fescron/diy-logging-volt-ampmeter/firmware/STM32F103C8T6_powermeter-interface/Core/Src/usart.c
	GPIO_InitStruct.Pin = LL_GPIO_PIN_3;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_FLOATING;
	LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* USART2 interrupt Init */
	NVIC_SetPriority(USART2_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
	NVIC_EnableIRQ(USART2_IRQn);

	/* UART2 Configuration */
	USART_InitStruct.BaudRate = BAUDRATE_METER;
	USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
	USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
	USART_InitStruct.Parity = LL_USART_PARITY_NONE;
	USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
	USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
	USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
	LL_USART_Init(USART2, &USART_InitStruct);
	LL_USART_ConfigAsyncMode(USART2);
	LL_USART_Enable(USART2);

	/* Initiate buffer mechanism */
	pBufferReadyForReception_USART2 = aRXBufferA_USART2;
	pBufferReadyForUser_USART2      = aRXBufferB_USART2;
	uwNbReceivedChars_USART2 = 0;
	uwBufferReadyIndication_USART2 = 0;

	/* Clear Overrun flag, in case characters have already been sent to USART */
	LL_USART_ClearFlag_ORE(USART2);

	/* Enable RXNE and Error interrupts */
	LL_USART_EnableIT_RXNE(USART2);
	LL_USART_EnableIT_ERROR(USART2);
}


/**************************************************************************//**
 * @brief
 *   USART3 Initialization Function.
 *
 * @details
 *   @li Baudrate = BAUDRATE_METER
 *   @li PB10 = USART3_TX
 *   @li PB11 = USART3_RX
 *****************************************************************************/
void USART3_INIT(void)
{
	LL_USART_InitTypeDef USART_InitStruct = {0};
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

	/* Peripheral clock enable */
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_GPIOB);

	/**USART3 GPIO Configuration
	PB10   ------> USART3_TX
	PB11   ------> USART3_RX
	*/
	GPIO_InitStruct.Pin = LL_GPIO_PIN_10;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_11;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_FLOATING;
	LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/* USART3 interrupt Init */
	NVIC_SetPriority(USART3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0, 0));
	NVIC_EnableIRQ(USART3_IRQn);

	/* UART3 Configuration */
	USART_InitStruct.BaudRate = BAUDRATE_METER;
	USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
	USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
	USART_InitStruct.Parity = LL_USART_PARITY_NONE;
	USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
	USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
	USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
	LL_USART_Init(USART3, &USART_InitStruct);
	LL_USART_ConfigAsyncMode(USART3);
	LL_USART_Enable(USART3);

	/* Initiate buffer mechanism */
	pBufferReadyForReception_USART3 = aRXBufferA_USART3;
	pBufferReadyForUser_USART3      = aRXBufferB_USART3;
	uwNbReceivedChars_USART3 = 0;
	uwBufferReadyIndication_USART3 = 0;

	/* Clear Overrun flag, in case characters have already been sent to USART */
	LL_USART_ClearFlag_ORE(USART3);

	/* Enable RXNE and Error interrupts */
	LL_USART_EnableIT_RXNE(USART3);
	LL_USART_EnableIT_ERROR(USART3);
}


/**************************************************************************//**
 * @brief
 *   Print a string (char array) to USARTx.
 *
 * @note
 *   If the input is not a string (ex.: `"Hello world!"`) but a char array,
 *   the input message (array) needs to end with NULL (`"\0"`)!
 *
 * @param[in] message
 *   The string to print to USARTx.
 *****************************************************************************/
void USART1_print(char *message)
{
	/* "message[i] != 0" makes "uint32_t length = strlen(message)"
	 * not necessary (given string MUST be terminated by NULL for this to work) */
	for (uint32_t i = 0; message[i] != 0; i++)
	{
		/* Wait for TXE flag to be raised */
		while (!LL_USART_IsActiveFlag_TXE(USART1));

		/* Write character in Transmit Data register.
		   TXE flag is cleared by writing data in DR register */
		LL_USART_TransmitData8(USART1, message[i]);
	}
}


/**************************************************************************//**
 * @brief
 *   Print a string (char array) to USART1.
 *
 * @param[in] string
 *   The string to print to USART1.
 *
 * @param[in] size
 *   Length of the string in bytes.
 *****************************************************************************/
//void USART1_SendData(char *string, uint32_t size)
//{
//	uint32_t index = 0;
//	char *pchar = string;
//
//	/* Send characters one per one, until last char to be sent */
//	for (index = 0; index < size; index++)
//	{
//		/* Wait for TXE flag to be raised */
//		while (!LL_USART_IsActiveFlag_TXE(USART1));
//
//		/* Write character in Transmit Data register.
//		   TXE flag is cleared by writing data in DR register */
//		LL_USART_TransmitData8(USART1, *pchar++);
//	}
//
//	/* Wait for TC flag to be raised for last char */
//	while (!LL_USART_IsActiveFlag_TC(USART1));
//}


/**************************************************************************//**
 * @brief
 *   Print a string (char array) to USART2.
 *
 * @param[in] string
 *   The string to print to USART2.
 *
 * @param[in] size
 *   Length of the string in bytes.
 *****************************************************************************/
//void USART2_SendData(uint8_t *string, uint32_t size)
//{
//	uint32_t index = 0;
//	uint8_t *pchar = string;
//
//	/* Send characters one per one, until last char to be sent */
//	for (index = 0; index < size; index++)
//	{
//		/* Wait for TXE flag to be raised */
//		while (!LL_USART_IsActiveFlag_TXE(USART2));
//
//		/* Write character in Transmit Data register.
//		   TXE flag is cleared by writing data in DR register */
//		LL_USART_TransmitData8(USART2, *pchar++);
//	}
//
//	/* Wait for TC flag to be raised for last char */
//	while (!LL_USART_IsActiveFlag_TC(USART2));
//}


/**************************************************************************//**
 * @brief
 *   Print a string (char array) to USART3.
 *
 * @param[in] string
 *   The string to print to USART3.
 *
 * @param[in] size
 *   Length of the string in bytes.
 *****************************************************************************/
//void USART3_SendData(uint8_t *string, uint32_t size)
//{
//	uint32_t index = 0;
//	uint8_t *pchar = string;
//
//	/* Send characters one per one, until last char to be sent */
//	for (index = 0; index < size; index++)
//	{
//		/* Wait for TXE flag to be raised */
//		while (!LL_USART_IsActiveFlag_TXE(USART3));
//
//		/* Write character in Transmit Data register.
//		   TXE flag is cleared by writing data in DR register */
//		LL_USART_TransmitData8(USART3, *pchar++);
//	}
//
//	/* Wait for TC flag to be raised for last char */
//	while (!LL_USART_IsActiveFlag_TC(USART3));
//}


/**************************************************************************//**
 * @brief
 *   Function called from USART1 IRQ Handler when RXNE flag is set. @n
 *   Function is in charge of reading character received on USART1 RX line.
 *****************************************************************************/
void USART1_CharReception_Callback(void)
{
	uint8_t *ptemp;

