Fescron/diy-logging-volt-ampmeter/firmware/STM32F103C8T6_powermeter-interface/Core/Src/usart.c
	/* Read Received character. RXNE flag is cleared by reading of DR register */
	pBufferReadyForReception_USART1[uwNbReceivedChars_USART1++] = LL_USART_ReceiveData8(USART1);

	/* Checks if Buffer full indication has been set */
	if (uwNbReceivedChars_USART1 >= RX_BUFFER_SIZE_UART1)
	{
		/* Set Buffer swap indication */
		uwBufferReadyIndication_USART1 = 1;

		/* Swap buffers for next bytes to be received */
		ptemp = pBufferReadyForUser_USART1;
		pBufferReadyForUser_USART1 = pBufferReadyForReception_USART1;
		pBufferReadyForReception_USART1 = ptemp;
		uwNbReceivedChars_USART1 = 0;
	}
}


/**************************************************************************//**
 * @brief
 *   Function called from USART2 IRQ Handler when RXNE flag is set. @n
 *   Function is in charge of reading character received on USART2 RX line.
 *****************************************************************************/
void USART2_CharReception_Callback(void)
{
	uint8_t *ptemp;

	/* Read Received character. RXNE flag is cleared by reading of DR register */
	pBufferReadyForReception_USART2[uwNbReceivedChars_USART2++] = LL_USART_ReceiveData8(USART2);

	/* Checks if Buffer full indication has been set */
	if (uwNbReceivedChars_USART2 >= RX_BUFFER_SIZE)
	{
		/* Set Buffer swap indication */
		uwBufferReadyIndication_USART2 = 1;

		/* Swap buffers for next bytes to be received */
		ptemp = pBufferReadyForUser_USART2;
		pBufferReadyForUser_USART2 = pBufferReadyForReception_USART2;
		pBufferReadyForReception_USART2 = ptemp;
		uwNbReceivedChars_USART2 = 0;
	}
}


/**************************************************************************//**
 * @brief
 *   Function called from USART3 IRQ Handler when RXNE flag is set. @n
 *   Function is in charge of reading character received on USART3 RX line.
 *****************************************************************************/
void USART3_CharReception_Callback(void)
{
	uint8_t *ptemp;

	/* Read Received character. RXNE flag is cleared by reading of DR register */
	pBufferReadyForReception_USART3[uwNbReceivedChars_USART3++] = LL_USART_ReceiveData8(USART3);

	/* Checks if Buffer full indication has been set */
	if (uwNbReceivedChars_USART3 >= RX_BUFFER_SIZE)
	{
		/* Set Buffer swap indication */
		uwBufferReadyIndication_USART3 = 1;

		/* Swap buffers for next bytes to be received */
		ptemp = pBufferReadyForUser_USART3;
		pBufferReadyForUser_USART3 = pBufferReadyForReception_USART3;
		pBufferReadyForReception_USART3 = ptemp;
		uwNbReceivedChars_USART3 = 0;
	}
}


/**************************************************************************//**
 * @brief
 *   Function called in case of error detected in USART1 IT Handler.
 *****************************************************************************/
void USART1_Error_Callback(void)
{
	__IO uint32_t sr_reg;

	/* Disable USART1_IRQn */
	NVIC_DisableIRQ(USART1_IRQn);

	/* Error handling example :
	- Read USART SR register to identify flag that leads to IT raising
	- Perform corresponding error handling treatment according to flag
	*/
	sr_reg = LL_USART_ReadReg(USART1, SR);
	if (sr_reg & LL_USART_SR_NE)
	{
		/* case Noise Error flag is raised : Clear NF Flag */
		LL_USART_ClearFlag_NE(USART1);
	}
	else
	{
		SEGGER_RTT_WriteString(0, RTT_CTRL_TEXT_BRIGHT_RED"Error: "RTT_CTRL_RESET"USART1_Error_Callback\n\r");
		while(1);
	}
}


/**************************************************************************//**
 * @brief
 *   Function called in case of error detected in USART2 IT Handler.
 *****************************************************************************/
void USART2_Error_Callback(void)
{
	__IO uint32_t sr_reg;

	/* Disable USART2_IRQn */
	NVIC_DisableIRQ(USART2_IRQn);

	/* Error handling example :
	- Read USART SR register to identify flag that leads to IT raising
	- Perform corresponding error handling treatment according to flag
	*/
	sr_reg = LL_USART_ReadReg(USART2, SR);
	if (sr_reg & LL_USART_SR_NE)
	{
		/* case Noise Error flag is raised : Clear NF Flag */
		LL_USART_ClearFlag_NE(USART2);
	}
	else
	{
		SEGGER_RTT_WriteString(0, RTT_CTRL_TEXT_BRIGHT_RED"Error: "RTT_CTRL_RESET"USART2_Error_Callback\n\r");
		while(1);
	}
}


/**************************************************************************//**
 * @brief
 *   Function called in case of error detected in USART3 IT Handler.
 *****************************************************************************/
void USART3_Error_Callback(void)
{
	__IO uint32_t sr_reg;

	/* Disable USART3_IRQn */
	NVIC_DisableIRQ(USART3_IRQn);

	/* Error handling example :
	- Read USART SR register to identify flag that leads to IT raising
	- Perform corresponding error handling treatment according to flag
	*/
	sr_reg = LL_USART_ReadReg(USART3, SR);
	if (sr_reg & LL_USART_SR_NE)
	{
		/* case Noise Error flag is raised : Clear NF Flag */
		LL_USART_ClearFlag_NE(USART3);
	}
	else
	{
		SEGGER_RTT_WriteString(0, RTT_CTRL_TEXT_BRIGHT_RED"Error: "RTT_CTRL_RESET"USART3_Error_Callback\n\r");
		while(1);
	}
}
